---
kind: property
id: P:Autodesk.Revit.UI.UIApplication.ProductIsRS
source: html/b4b3ff0a-242a-d829-7b0d-f8a0918c9486.htm
---
# Autodesk.Revit.UI.UIApplication.ProductIsRS Property

Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.

## Syntax (C#)
```csharp
public bool ProductIsRS { get; }
```